Autodesk.Revit.DB.BuiltInFailures.WallFailures.WallSettingsChanged
Default wall settings will be changed (Base Constraint: [Base Level], Base Offset: [Base Offset], Top Constraint: [Top Level], Top Offset: [Top Offset])

Autodesk.Revit.DB.BuiltInFailures.WallFailures.WallNegativeHeight
The top of the Wall is lower than the base of the Wall.

Autodesk.Revit.DB.BuiltInFailures.WallFailures.WallLacksCurve
Wall does not have both a curve driver and a curve!!!!

Autodesk.Revit.DB.BuiltInFailures.WallFailures.WallCutoutForInsertionFailure
Can't cut wall for inserted objects

Autodesk.Revit.DB.BuiltInFailures.WallFailures.VerticalLayerExtensionFailureError
Cannot extend layer(s) of the highlighted vertically compound wall.

Autodesk.Revit.DB.BuiltInFailures.WallFailures.VerticalLayerExtensionFailure
Cannot extend layer(s) of the highlighted vertically compound wall.

Autodesk.Revit.DB.BuiltInFailures.WallFailures.UnjoinOnEditWallChange
Line associated with a joined face has been moved.  This action will cause the other walls to become disjoined from this face. [Description]

Autodesk.Revit.DB.BuiltInFailures.WallFailures.UnableToDeleteWallForPanel
Unable to delete curtain panel wall.

Autodesk.Revit.DB.BuiltInFailures.WallFailures.UnableToCreateWallForPanel
Unable to create wall for curtain wall panel.

Autodesk.Revit.DB.BuiltInFailures.WallFailures.TooShortStackedWall
Stacked wall instance is too short.

Autodesk.Revit.DB.BuiltInFailures.WallFailures.StackedWallNeedsUnjoin
A subwall of this stacked wall is unjoined from its neighbors because it was pulled too far.

Autodesk.Revit.DB.BuiltInFailures.WallFailures.ShouldAdjustWallParameters
The best way to control top and base of the Wall is to modify the Constraints and Offset Parameters in Properties dialog.

Autodesk.Revit.DB.BuiltInFailures.WallFailures.ShorterThanMinWallFailure
Wall is shorter than minimum height allowed by its type.\nIt is [Length] and must be at least [Length].

Autodesk.Revit.DB.BuiltInFailures.WallFailures.ShorterThanMinWallError
Wall is shorter than minimum height allowed by its type.\nIt is [Length] and must be at least [Length].

Autodesk.Revit.DB.BuiltInFailures.WallFailures.ShorterThanMinWall
Wall is shorter than minimum height allowed by its type.\nIt is [Length] and must be at least [Length].

Autodesk.Revit.DB.BuiltInFailures.WallFailures.RemapConstrainLocationLine
Existing locked constraints to the Location Line will be transferred to the new Location Line position. Press "Unconstrain" to remove the constraint rather than transferring it.

Autodesk.Revit.DB.BuiltInFailures.WallFailures.RecursionParameterIgnored
Parameter-defined type of curtain panels defined in a circular way and will be ignored.

Autodesk.Revit.DB.BuiltInFailures.WallFailures.ParameterChangeNotAffectingGeometry
Changing this element's parameter has no effect on its current position or geometry. Check to see if the element is constrained either in the project view or in the element's sketch.

Autodesk.Revit.DB.BuiltInFailures.WallFailures.LostEditsJoinsRedoFaceBased
Previous edits and /or wall joins will not be preserved on this operation.

Autodesk.Revit.DB.BuiltInFailures.WallFailures.InvalidTopConstraintForLevel
Top Constraint is invalid for the Level.

Autodesk.Revit.DB.BuiltInFailures.WallFailures.InvalidTargetPositionError
Joining the highlighted wall to the highlighted element moves the wall's top below its bottom or its bottom above its top, or interferes with wall joins or holes in the wall.

Autodesk.Revit.DB.BuiltInFailures.WallFailures.InvalidTargetPosition
Joining the highlighted wall to the highlighted element moves the wall's top below its bottom or its bottom above its top, or interferes with wall joins or holes in the wall.

Autodesk.Revit.DB.BuiltInFailures.WallFailures.InvalidCompoundStructure
Invalid compound structure.

Autodesk.Revit.DB.BuiltInFailures.WallFailures.InvalidBaseConstraintForLevel
Base Constraint is invalid for the Level.

Autodesk.Revit.DB.BuiltInFailures.WallFailures.FailedToStoreSideFace
Failed to store wall side face. Wall sweeps on this wall will fail to regenerate.

Autodesk.Revit.DB.BuiltInFailures.WallFailures.FailedToChangeInstSymbol
Failed to change symbol of instance.

Autodesk.Revit.DB.BuiltInFailures.WallFailures.FailedConvertWallToPanel
Unable to convert wall to panel.

Autodesk.Revit.DB.BuiltInFailures.WallFailures.FaceWallMissingFace
No picked face found.

Autodesk.Revit.DB.BuiltInFailures.WallFailures.FaceWallFailedToMake
Can't make Face Wall shape.

Autodesk.Revit.DB.BuiltInFailures.WallFailures.FaceWallComplexType
Vertically compound wall type features sweeps, reveals, or split layers are not supported on non-vertical face. Consider using a simplified type.

Autodesk.Revit.DB.BuiltInFailures.WallFailures.FaceWallBadType
Wall type '[Type Name]' is incompatible with picked face. Only basic wall types are accepted.

Autodesk.Revit.DB.BuiltInFailures.WallFailures.FaceIsNoLongerVertical
Face defining this vertical Wall is no longer vertical.

Autodesk.Revit.DB.BuiltInFailures.WallFailures.FaceIsNoGoodForWall
Defining face is not suitable for walls.

Autodesk.Revit.DB.BuiltInFailures.WallFailures.FaceBecameVertical
Face defining this non-vertical Wall is vertical.

Autodesk.Revit.DB.BuiltInFailures.WallFailures.EmbeddedButShouldNotBe
Conditions for wall embedding are no longer satisfied.

Autodesk.Revit.DB.BuiltInFailures.WallFailures.ContFootingRadiusTooSmall
Can't display the Wall Foundation, because the Wall's radius is too small.  Please increase the radius to display the Wall Foundation.

Autodesk.Revit.DB.BuiltInFailures.WallFailures.ContFootingCannotJoin
Miter plane for Wall Foundation join is too far away; Bisecting plane will be used instead.

Autodesk.Revit.DB.BuiltInFailures.WallFailures.ConstrainedToWallError
Sketch Lines created with Pick Wall must remain parallel to the Wall.

Autodesk.Revit.DB.BuiltInFailures.WallFailures.ConstrainedToWall
Sketch Lines created with Pick Wall must remain parallel to the Wall.

Autodesk.Revit.DB.BuiltInFailures.WallFailures.ChangingWallsweepType
This wall sweep instance has different profile or material than its type. You may delete the sweep, or if you ignore this warning, it will be regenerated according to its type.

Autodesk.Revit.DB.BuiltInFailures.WallFailures.CannotUpdateWallPanel
Unable to update wall panel.

Autodesk.Revit.DB.BuiltInFailures.WallFailures.CannotToSplitWallPanels
Unable to split wall panel(s).

Autodesk.Revit.DB.BuiltInFailures.WallFailures.CannotSplitVerticallyCompoundWall
Can't divide Wall's face to assign different materials to a vertically compound Wall.

Autodesk.Revit.DB.BuiltInFailures.WallFailures.CannotSplitJoinHostsInplaceFamilies
Can't split/join this host because there are instances of In-place Families that cut openings into it. Edit or delete instances first so they don't cut into the host to be split or joined.

Autodesk.Revit.DB.BuiltInFailures.WallFailures.CannotRedoFaceRoof
"Faces defining this Roof cannot be reacquired. Either delete the Roof or leave as it is.

Autodesk.Revit.DB.BuiltInFailures.WallFailures.CannotRedoFaceBasedWarn
Faces defining this Element cannot be reacquired.

Autodesk.Revit.DB.BuiltInFailures.WallFailures.CannotRedoFaceBased
Faces defining this Element cannot be reacquired.

Autodesk.Revit.DB.BuiltInFailures.WallFailures.CannotMirrorWallPanel
Cannot mirror wall panels.

Autodesk.Revit.DB.BuiltInFailures.WallFailures.CannotMaintainKeyReference
Can't maintain the position of the Location Line in this Wall.

Autodesk.Revit.DB.BuiltInFailures.WallFailures.CannotChangeTypeOfOldCurtainPanel
Cannot change the type of curtain panels in walls created with early versions of Revit. To change the panels of this curtain wall, wall must be recreated.

Autodesk.Revit.DB.BuiltInFailures.WallFailures.CannotChangeSubwall
Changing the type of a subwall is not allowed. Edit the stacked wall type instead.

Autodesk.Revit.DB.BuiltInFailures.WallFailures
Failures about Wall.